---
kind: property
id: P:Autodesk.Revit.DB.FamilySymbolProfile.YOffset
source: html/05a5e28a-e085-62dd-509a-ddd30f789b85.htm
---
# Autodesk.Revit.DB.FamilySymbolProfile.YOffset Property

The offset of the profile to the origin of the sketch plane in the Y direction.

## Syntax (C#)
```csharp
public double YOffset { get; set; }
```